# ShadeDepth Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..ShadeDepth Property
MassSurfaceData Class See Also
---
How far any auto-generated shades should extend from the wall surface.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double ShadeDepth { get; set; }
```

Visual Basic
---
```text
Public Property ShadeDepth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ShadeDepth {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The shade depth is less than zero. |

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace